Rotating_Drum_CFDEM_adaptation/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

drum_t 0.063;
R 0.0515;
eps 0.001;

xlo  #calc "-$eps";
xhi  #calc "$drum_t + $eps";

ylo  #calc "-$R - $eps";
yhi  #calc "$R + $eps";

zlo  #calc "-$R - $eps";
zhi  #calc "$R + $eps";
// number of cells (ADJUST!)
nx  100;
ny  60;
nz  60;

//        z
//        ↑
//        |
//        7 -------- 6
//       /|         /|
//      / |        / |
//     3 -------- 2  |
//     |  |       |  |
//     |  4 ------|--5   → x
//     | /        | /
//     |/         |/
//     0 -------- 1
//    /
//   y
//   
vertices
(
    ($xlo $ylo $zlo)  // 0
    ($xhi $ylo $zlo)  // 1
    ($xhi $yhi $zlo)  // 2
    ($xlo $yhi $zlo)  // 3
    ($xlo $ylo $zhi)  // 4
    ($xhi $ylo $zhi)  // 5
    ($xhi $yhi $zhi)  // 6
    ($xlo $yhi $zhi)  // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)   // x = xlo
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)   // x = xhi
        );
    }

    wall
    {
        type wall;
        faces
        (
            (0 1 5 4)   // bottom
            (3 7 6 2)   // top
            (0 3 2 1)   // side
            (4 5 6 7)   // side
        );
    }
);

// ************************************************************************* //
